#pragma once

#include "Phone.h"

/**
	* Метод визначення чи є ціна першого
	* телефону більшою за ціну другого телефону.
	* @param firstPhone вказівник на перший порівнюваний телефон.
	* @param secondPhone вказівник на другий порівнюваний телефон.
	* @return логічну змінна чи є ціна першого
	* телефону більшою за ціну другого телефону
	*/
bool ascendingPrice(Phone* firstPhone, Phone* secondPhone);

/**
* Метод визначення чи є розширення екрану першого
* телефону більшим за розширення екрану другого телефону.
* @param firstPhone вказівник на перший порівнюваний телефон.
* @param secondPhone вказівник на другий порівнюваний телефон.
* @return логічну змінна чи є розширення екрану першого
* телефону більшим за розширення екрану другого телефону
*/
bool ascendingResolution(Phone* firstPhone, Phone* secondPhone);

/**
* Метод визначення чи є ємність батареї першого
* телефону більшою за ємність батареї другого телефону.
* @param firstPhone вказівник на перший порівнюваний телефон.
* @param secondPhone вказівник на другий порівнюваний телефон.
* @return логічну змінна чи є ємність батареї першого
* телефону більшою за ємність батареї другого телефону
*/
bool ascendingCapacity(Phone* firstPhone, Phone* secondPhone);

/**
* Метод визначення чи є ціна першого
* телефону меншою за ціну другого телефону.
* @param firstPhone вказівник на перший порівнюваний телефон.
* @param secondPhone вказівник на другий порівнюваний телефон.
* @return логічну змінна чи є ціна першого
* телефону меншою за ціну другого телефону
*/
bool descendingPrice(Phone* firstPhone, Phone* secondPhone);

/**
* Метод визначення чи є розширення екрану першого
* телефону меншим за розширення екрану другого телефону.
* @param firstPhone вказівник на перший порівнюваний телефон.
* @param secondPhone вказівник на другий порівнюваний телефон.
* @return логічну змінна чи є розширення екрану першого
* телефону меншим за розширення екрану другого телефону
*/
bool descendingResolution(Phone* firstPhone, Phone* secondPhone);

/**
* Метод визначення чи є ємність батареї першого
* телефону меншою за ємність батареї другого телефону.
* @param firstPhone вказівник на перший порівнюваний телефон.
* @param secondPhone вказівник на другий порівнюваний телефон.
* @return логічну змінна чи є ємність батареї першого
* телефону меншою за ємність батареї другого телефону
*/
bool descendingCapacity(Phone* firstPhone, Phone* secondPhone);