/**
* @mainpage
* <b> Лабораторна робота № 1. <br/> Класи </b>
* <br/><b><i>Мета роботи:</i>
* </b>Отримати базові знання про класи. Дослідити механізм інкапсуляції. <br/>
* <b><i>Загальне завдання:</i></b>

* Клас, що відображає сутність «базового класу». При цьому, в
* даному класі повинно бути мінімум три числових поля (бажано, щоб одне з
* цих полів було унікальним ідентифікатором об’єкту);

* Клас, що має в собі динамічний масив об’єктів базового класу та
* має в собі методи додавання, видалення елементу, отримання елементу по
* індексу (або ідентифікатору), вивід усіх елементів на екран. Рекомендовані
* сигнатури методів:* -Додавання;

* -Видалення;

* -Отримання по індексу;

* -Вивід усіх елементів;

* <b><i>Індивідуальне завдання:</i></b>
* В табл. 1.2 обрати прикладну галузь по
* варіанту у відповідності до номера у журналі групи.
* <br/>
* <b><i> Додаткові умови виконання завдання: </i></b>
* − звіт має бути виконаний згідно з вимогами до оформлення робіт;
* − проект має складатися мінімум з трьох файлів;
* − продемонструвати відсутність витоків пам’яті;
* <br/>
*
* @author Klishchov B.
* @date 07-02-2019
* @version 1.2
*/
#include"Header.h"
#include"Header1.h"


int main()
{
	Country C1;
	C1.CountryFill(555, (char*)"Poland", 21, 160, 190); 
	CountryArr C2;
	C2.CountryAdd(C1); 
	C1.CountryFill(111, (char*)"USA", 19, 152, 127); 
	C2.CountryAdd(C1); 
	C1.CountryFill(222, (char*)"Japan", 18, 140, 146);
	C2.CountryAdd(C1); 
	C1.CountryFill(123, (char*)"Greese", 15, 195, 193); 
	C2.CountryAdd(C1); 
	C2.CountryPrint();
	printf("\n"); 

	C2.CountryRemove(0); 
	C2.CountryPrint(); 
	system("pause"); 
	return 0;
}